app/views/actions/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "participants" ON "users"."id" = "participants"."user_id" WHERE "participants"."action_id" = $1  [["action_id", 7]]
---
<div class="col-md-4">
<% e.users.each do |user|%>